tests/src/Mock/PurchasePaypalCompleteSuccess.http

HTTP/1.1 200 OK
Server: Apache-Coyote/1.1
PROXY_SERVER_INFO: host=slcsbplatformapiserv3001.slc.paypal.com;threadId=605
Paypal-Debug-Id: 4b971cdb527a3
SERVER_INFO: paymentsplatformserv:v1.payments.payment&CalThreadId=128&TopLevelTxnStartTime=149191417ca&Host=slcsbjm3.slc.paypal.com&pid=10739
Content-Language: *
Date: Thu, 16 Oct 2014 13:09:49 GMT
Content-Type: application/json
Content-Length: 1802

{"id":"PAY-7N5239784Y302191WKQ72KJI","create_time":"2014-10-16T10:59:49Z","update_time":"2014-10-16T13:09:49Z","state":"approved","intent":"sale","payer":{"payment_method":"paypal","payer_info":{"email":"buyer@openbuildings.com","first_name":"Buyer","last_name":"Clippings","payer_id":"HVMBSS6TABKJN","shipping_address":{"line1":"1 Main St","city":"San Jose","state":"CA","postal_code":"95131","country_code":"US","recipient_name":"Buyer Clippings"}}},"transactions":[{"amount":{"total":"15.00","currency":"GBP","details":{"subtotal":"15.00"}},"item_list":{"items":[{"name":"10","price":"5.00","currency":"GBP","quantity":"2","description":"Product 1 Desc"},{"name":"12","price":"5.00","currency":"GBP","quantity":"1","description":"Shipping for Product 1"}],"shipping_address":{"recipient_name":"Buyer Clippings","line1":"1 Main St","city":"San Jose","state":"CA","postal_code":"95131","country_code":"US"}},"related_resources":[{"sale":{"id":"96G836504V833741T","create_time":"2014-10-16T10:59:49Z","update_time":"2014-10-16T13:09:49Z","amount":{"total":"15.00","currency":"GBP"},"payment_mode":"INSTANT_TRANSFER","state":"completed","protection_eligibility":"ELIGIBLE","protection_eligibility_type":"ITEM_NOT_RECEIVED_ELIGIBLE,UNAUTHORIZED_PAYMENT_ELIGIBLE","parent_payment":"PAY-7N5239784Y302191WKQ72KJI","links":[{"href":"https://api.sandbox.paypal.com/v1/payments/sale/96G836504V833741T","rel":"self","method":"GET"},{"href":"https://api.sandbox.paypal.com/v1/payments/sale/96G836504V833741T/refund","rel":"refund","method":"POST"},{"href":"https://api.sandbox.paypal.com/v1/payments/payment/PAY-7N5239784Y302191WKQ72KJI","rel":"parent_payment","method":"GET"}]}}]}],"links":[{"href":"https://api.sandbox.paypal.com/v1/payments/payment/PAY-7N5239784Y302191WKQ72KJI","rel":"self","method":"GET"}]}
