tests/src/Mock/PurchaseRefundSuccess.http

HTTP/1.1 201 Created
Server: Apache-Coyote/1.1
PROXY_SERVER_INFO: host=slcsbplatformapiserv3001.slc.paypal.com;threadId=310
Paypal-Debug-Id: d4a8ff29b1cba
SERVER_INFO: paymentsplatformserv:v1.payments.sale&CalThreadId=6792&TopLevelTxnStartTime=149197a60db&Host=slcsbpaymentsplatformserv3002.slc.paypal.com&pid=14199
Content-Language: *
Date: Thu, 16 Oct 2014 15:01:31 GMT
Content-Type: application/json
Content-Length: 592

{"id":"45K214221M5976101","create_time":"2014-10-16T15:01:32Z","update_time":"2014-10-16T15:01:32Z","state":"completed","amount":{"total":"1.50","currency":"USD"},"sale_id":"92M94738P51857122","parent_payment":"PAY-9WH53771YR8601443KQ7325Q","links":[{"href":"https://api.sandbox.paypal.com/v1/payments/refund/45K214221M5976101","rel":"self","method":"GET"},{"href":"https://api.sandbox.paypal.com/v1/payments/payment/PAY-9WH53771YR8601443KQ7325Q","rel":"parent_payment","method":"GET"},{"href":"https://api.sandbox.paypal.com/v1/payments/sale/92M94738P51857122","rel":"sale","method":"GET"}]}
